01-ahmed-body/cases/slant10_re4.18M_symtest_transient/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 10deg TRANSIENT (PIMPLE), level (4 5) mesh, nCellsBetweenLevels 2.
// deltaT from scripts/compute_transient_deltat.py on THIS mesh
// (dx 1.003 mm, U 60 m/s, Co 0.5); adjustTimeStep takes over from there.
// endTime is the first stage only; extended in stages via latestTime.
// purgeWrite 2 is a user requirement, so no wake-evolution frames are
// kept as time directories. The y=0.10 m slice below preserves them, and
// the probe runs inside the solver because nothing is left to
// post-process afterwards.
application     foamRun;
solver          incompressibleFluid;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         0.35;
deltaT          8.358e-06;
adjustTimeStep  yes;
maxCo           0.5;
writeControl    adjustableRunTime;
writeInterval   0.001;
purgeWrite      2;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    #include "forceCoeffs"

    // Same point as the 25deg wakeProbes file, sampled every 10 steps.
    wakeProbes
    {
        #include "wakeProbes"
        writeControl    timeStep;
        writeInterval   10;
    }

    // Slice on the y=0.10 m plane (same plane as 25deg and 0deg
    // visualization), written at each write time. Uses the OpenFOAM 11
    // cutPlaneSurface template, with its variables set here.
    cutPlaneSurface
    {
        point       (0 0.10 0);
        normal      (0 1 0);
        fields      (U p);
        interpolate true;
        #includeEtc "caseDicts/postProcessing/surface/cutPlaneSurface.cfg"
    }
}

// ************************************************************************* //
