01-ahmed-body/cases/slant10_re4.18M_symtest_transient/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }
    pFinal
    {
        $p;
        relTol          0;
    }
    Phi
    {
        $p;
    }
    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }
    "(U|k|omega)Final"
    {
        $U;
        relTol          0;
    }
}
PIMPLE
{
    // Verified syntax from /opt/openfoam11/tutorials/incompressibleFluid/
    // pitzDaily/system/fvSolution. nCorrectors=2 is a standard PIMPLE
    // starting point for pressure-velocity coupling in transient runs.
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
}
potentialFlow
{
    nNonOrthogonalCorrectors 10;
}
// No relaxationFactors: transient PIMPLE with proper Final-iteration
// solves (relTol 0) does not require the same under-relaxation as
// steady SIMPLE/SIMPLEC -- implicit time integration itself provides
// stability. This is a genuine change from the steady case, flagged
// explicitly. If startup shows instability, this is the first thing
// to revisit.
cache
{
    grad(U);
}
// ************************************************************************* //
